#бесполезные факты
#демонстрирует набор навыков за 2 главы книги
#доусона python
name=input("Привет.Как тебя зовут?:")
print("Здароу ",name.upper())
age=int(input("Сколько тебе лет?:"))
print("Малодзеньки яшчэ")
weight=int(input("окей и последний вопрос.Кольки у табе весу?:"))
print("\a\a\a", "***хуя :) ")
print(input("клацани ка хутчэй па клаве enter каб пару фактикау" +
            " табе прагутарыть"))
seconds=age*365*3600*24
print("Твой нынешний возраст - " , "свыше" , seconds , "секунд.")
moon_weight=weight/6
print("на луне бы ты весил поменьше,а именно- ",moon_weight,"кг")
sun_weight=weight*27
print("а на солнышке то нашем весил бы ты -" + str(sun_weight) + "кг")
input("\n\n\n нажми-ка есчо разок  enter фраерок.")
