#silly strings
#демонстрирует сцепление  и повторение строк
print("Две строки можно"+" сцепить с помощью оператора '+'.")
print("\nЭта строка " + "вряд ли" + "удив" + "ит вас." \
      + "Но интересно." + "что" + "она-\n" + "одна длинная-длин" \
      + "на" + "я" + "строка" \
  + "из" + "двадцати двух\n" \
      + "отдельных строк,разбитых"\
      + "на шесть строк."+"Достаточно ли вы" + " впечатлены?" + "Ну хватит.\n"\
      + "вот " + "наша" + "длинная " + "строка" + "и" + "закончилась!")
      
print("Pie\t\t\n"*10)
print("twenty one"
      +"twenty two")
print("what",
      "your",
      "name")
print("""please



        forgive me""")
